app/Models/ColaboradorModel.php

    public function contarUsuarios($search = '')
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);

        $builder->select('ccp_usuario.id')
            ->join('ccp_persona', 'ccp_usuario.persona_id = ccp_persona.id', 'inner')
            ->join('ccp_persona_identificacion', 'ccp_persona_identificacion.id_persona = ccp_persona.id', 'left')
            ->join('ccp_email', 'ccp_email.persona_id = ccp_persona.id', 'left') // Agregar la tabla de correos
            ->where('ccp_usuario.estado', 1);

        if (!empty($search)) {
            $builder->groupStart()
                ->like('ccp_usuario.usuario', $search)
                ->orLike('ccp_persona.nombres', $search)
                ->orLike('ccp_persona.apellido_paterno', $search)
                ->orLike('ccp_persona.apellido_materno', $search)
                ->orLike('ccp_persona_identificacion.identificacion_descripcion', $search)
                ->orLike('ccp_persona.direccion', $search)
                ->orLike('ccp_email.email', $search) // Filtrar por correo
                ->groupEnd();
        }

        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ccp_usuario`
INNER JOIN `ccp_persona` ON `ccp_usuario`.`persona_id` = `ccp_persona`.`id`
LEFT JOIN `ccp_persona_identificacion` ON `ccp_persona_identificacion`.`id_persona` = `ccp_persona`.`id`
LEFT JOIN `ccp_email` ON `ccp_email`.`persona_id` = `ccp_persona`.`id`
WHERE `ccp_usuario`.`estado` = 1
AND   (
`ccp_usuario`.`usuario` LIKE '%mario%' ESCAPE '!'
OR  `ccp_persona`.`nombres` LIKE '%mario%' ESCAPE '!'
OR  `ccp_persona`.`apellido_paterno` LIKE '%mario%' ESCAPE '!'
OR  `ccp_persona`.`apellido_materno` LIKE '%mario%' ESCAPE '!'
OR  `ccp_persona_identificacion`.`identificacion_descripcion` LIKE '%mario%' ESCAPE '!'
OR  `ccp_persona`.`direccion` LIKE '%mario%' ESCAPE '!'
OR  `ccp_email`.`email` LIKE '%mario%' ESCAPE '!'
 )

    public function obtenerColaboradorPorId($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('ccp_usuario');
        $builder->select('
            ccp_usuario.id,
            ccp_usuario.usuario,
            ccp_usuario.estado,
            ccp_persona.id AS persona_id,
            ccp_persona.nombres,
            ccp_persona.apellido_paterno,
            ccp_persona.apellido_materno,
            ccp_persona.direccion,
            ccp_persona_identificacion.id_tipo_identificacion,
            ccp_persona_identificacion.identificacion_descripcion
        ');
        $builder->join('ccp_persona', 'ccp_usuario.persona_id = ccp_persona.id', 'inner');
        $builder->join('ccp_persona_identificacion', 'ccp_persona_identificacion.id_persona = ccp_persona.id', 'left');
        $builder->where('ccp_usuario.id', $id);
        $colaborador = $builder->get()->getRowArray();

        if (!$colaborador) {
            return null;
        }

        // Obtener correos electrónicos
        $emails = $db->table('ccp_email')
            ->select('email')
            ->where('persona_id', $colaborador['persona_id'])
            ->get()
            ->getResultArray();
        $colaborador['emails'] = array_map(fn($email) => $email['email'], $emails);

        // Obtener teléfonos
        $telefonos = $db->table('ccp_telefono')
            ->select('numero')
            ->where('persona_id', $colaborador['persona_id'])
            ->get()
            ->getResultArray();
        $colaborador['telefonos'] = array_map(fn($telefono) => $telefono['numero'], $telefonos);

        // Obtener roles correctamente
        $roles = $db->table('ccp_usuario_rol')
            ->select('rol_id')
            ->where('usuario_id', $colaborador['id'])
            ->get()
            ->getResultArray();
---
SELECT `email`
FROM `ccp_email`
WHERE `persona_id` = '5'
SELECT `numero`
FROM `ccp_telefono`
WHERE `persona_id` = '5'
SELECT `rol_id`
FROM `ccp_usuario_rol`
WHERE `usuario_id` = '4'