app/Models/FuncionModel.php

    public function obtenerRoles()
    {
        $db = \Config\Database::connect();

        return $db->table('ccp_rol')
            ->select('id, nombre')
            ->orderBy('nombre', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `nombre`
FROM `ccp_rol`
ORDER BY `nombre` ASC

    public function obtenerTipoIdentificacion()
    {
        $db = \Config\Database::connect();

        return $db->table('ccp_tipo_identificacion')
            ->select('id_tipo_identificacion, identificacion_nombre')
            ->orderBy('id_tipo_identificacion', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id_tipo_identificacion`, `identificacion_nombre`
FROM `ccp_tipo_identificacion`
ORDER BY `id_tipo_identificacion` ASC

    public function obtenerDepartamentos()
    {
        $db = \Config\Database::connect();

        return $db->table('ccp_ubigeo_peru_departments')
            ->select('id AS codigo_departamento, name AS nombre_departamento')
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id` AS `codigo_departamento`, `name` AS `nombre_departamento`
FROM `ccp_ubigeo_peru_departments`
ORDER BY `name` ASC

    public function obtenerProvincias($codigo_departamento)
    {
        $db = \Config\Database::connect();

        return $db->table('ccp_ubigeo_peru_provinces')
            ->select('id AS codigo_provincia, name AS nombre_provincia')
            ->where('department_id', $codigo_departamento)
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id` AS `codigo_provincia`, `name` AS `nombre_provincia`
FROM `ccp_ubigeo_peru_provinces`
WHERE `department_id` = '15'
ORDER BY `name` ASC

    public function obtenerDistritos($codigo_departamento, $codigo_provincia)
    {
        $db = \Config\Database::connect();

        return $db->table('ccp_ubigeo_peru_districts')
            ->select('id AS codigo_distrito, name AS nombre_distrito')
            ->where('department_id', $codigo_departamento)
            ->where('province_id', $codigo_provincia)
            ->orderBy('name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id` AS `codigo_distrito`, `name` AS `nombre_distrito`
FROM `ccp_ubigeo_peru_districts`
WHERE `department_id` = '15'
AND `province_id` = '1502'
ORDER BY `name` ASC