app/Models/MenuModel.php

    public function obtenerMenuPorRoles($roles = [])
    {
        // Asegúrate de que los roles sean un array válido
        if (!is_array($roles) || empty($roles)) {
            return []; // Si no hay roles, retorna un menú vacío
        }

        $db = \Config\Database::connect();

        $builder = $db->table($this->table);
        $builder->select('ccp_menu.id, ccp_menu.nombre, ccp_menu.ruta, ccp_menu.padre_id, ccp_menu.icono, ccp_menu.orden, ccp_menu.estado')
                ->join('ccp_rol_permiso', 'ccp_menu.id = ccp_rol_permiso.menu_id', 'inner')
                ->join('ccp_usuario_rol', 'ccp_rol_permiso.rol_id = ccp_usuario_rol.rol_id', 'inner')
                ->where('ccp_menu.estado', 1)
                ->whereIn('ccp_usuario_rol.rol_id', $roles) // Filtrar por los roles del usuario
                ->groupBy('ccp_menu.id') // Evitar duplicados
                ->orderBy('ccp_menu.orden', 'ASC');

        $result = $builder->get()->getResultArray();
---
SELECT `ccp_menu`.`id`, `ccp_menu`.`nombre`, `ccp_menu`.`ruta`, `ccp_menu`.`padre_id`, `ccp_menu`.`icono`, `ccp_menu`.`orden`, `ccp_menu`.`estado`
FROM `ccp_menu`
INNER JOIN `ccp_rol_permiso` ON `ccp_menu`.`id` = `ccp_rol_permiso`.`menu_id`
INNER JOIN `ccp_usuario_rol` ON `ccp_rol_permiso`.`rol_id` = `ccp_usuario_rol`.`rol_id`
WHERE `ccp_menu`.`estado` = 1
AND `ccp_usuario_rol`.`rol_id` IN ('1','2')
GROUP BY `ccp_menu`.`id`
ORDER BY `ccp_menu`.`orden` ASC

    public function verificarPermisoRuta($roles, $route)
    {
        $db = \Config\Database::connect();

        // Normalizar la ruta para obtener la ruta base
        $normalizedRoute = ltrim($route, '/'); // Eliminar el slash inicial
        $baseRoute = '/' . strtok($normalizedRoute, '/'); // Ruta base (primer segmento)

        // Construir la consulta
        $builder = $db->table($this->table);
        $builder->select('ccp_menu.ruta')
            ->join('ccp_rol_permiso', 'ccp_menu.id = ccp_rol_permiso.menu_id', 'inner')
            ->whereIn('ccp_rol_permiso.rol_id', $roles)
            ->groupStart()
                ->where('ccp_menu.ruta', '/' . $normalizedRoute) // Coincidencia exacta
                ->orWhere('ccp_menu.ruta', $baseRoute) // Coincidencia con la ruta base
            ->groupEnd()
            ->where('ccp_menu.estado', 1); // Validar solo rutas activas

        $result = $builder->get()->getRow();
---
SELECT `ccp_menu`.`ruta`
FROM `ccp_menu`
INNER JOIN `ccp_rol_permiso` ON `ccp_menu`.`id` = `ccp_rol_permiso`.`menu_id`
WHERE `ccp_rol_permiso`.`rol_id` IN ('1','2')
AND   (
`ccp_menu`.`ruta` = '/colaborador/editar/([0-9]+)'
OR `ccp_menu`.`ruta` = '/colaborador'
 )
AND `ccp_menu`.`estado` = 1